<?php error_reporting(-1);

    # ТЕРНАРНЫЙ ОПЕРАТОР

    // $price = 12;
    // if ($price <= 10) {
    //     echo 'доступная цена';
    // } else {
    //     echo 'дорогая цена для тебя';
    // }


    // $light = 'green';
    // if ($light == 'green') {
    //     echo 'Ты можешь идти';
    // } else {
    //     echo 'Стой, придурок';
    // }


    // echo $light == 'green' ? 'Ты можешь идти' : 'Стой, придурок'; // тернарная конструкция '?:'


    // echo ($light == 'green') ? ('Ты можешь идти') : ('Стой, придурок'); // 2й способ -> заключение в скобки
